<?php

return [
    'image' => [
        'required' => 'حقل الصورة مطلوب.',
        'file' => 'يجب أن يكون الملف من نوع ملف.',
        'mimes' => 'يجب أن يكون الملف من الأنواع: jpeg, png, jpg, gif, svg.',
        'max' => 'لا يمكن أن يتجاوز حجم الصورة 2048 كيلوبايت.',
    ],
    'TOO_MANY_ATTEMPTS'=>'محاولات كثيرة جدًا',
    "INVALID_TOKEN"=>'رمز أو مستخدم غير صالح.' ,
    "VALID_TOKEN"=>'رمز أو مستخدم  صالح.' ,
    'TOKEN_EXPIRED'=> 'انتهت صلاحية الكود. حاول مرة أخرى لاحقًا.' ,
    'correct_answer_media.required' => 'وسائط تحديد الاجابة الصحيحة مطلوب' ,
    'wrong_answer_media.required' =>'وسائط تحديد الاجابة الخاطئة مطلوب' ,

    'you_not_approved' => 'لم تتم الموافقة عليك',

    // رسائل المالك (admin)
    'name.required' => 'الاسم مطلوب.',
    'name.string' => 'الاسم يجب أن يكون نصًا.',
    'name.max' => 'الاسم لا يجب أن يتجاوز 255 حرفًا.',


    'password.required' => 'كلمة المرور مطلوبة.',
    'password.string' => 'كلمة المرور يجب أن تكون نصًا.',
    'password.min' => 'كلمة المرور يجب أن تكون على الأقل :min أحرف.',
    'password.confirmed' => 'تأكيد كلمة المرور غير مطابق.',

    // رسائل الصيدلية (pharmacy)
    'name_pharmacy.required' => 'اسم الصيدلية مطلوب.',
    'name_pharmacy.string' => 'اسم الصيدلية يجب أن يكون نصًا.',
    'name_pharmacy.max' => 'اسم الصيدلية لا يجب أن يتجاوز 255 حرفًا.',

    'image_pharmacy.required' => 'صورة الصيدلية مطلوبة.',
    'image_pharmacy.image' => 'الصورة يجب أن تكون من نوع صورة (jpg أو png أو jpeg).',

    'license_number.required' => 'رقم الترخيص مطلوب.',
    'license_number.unique' => 'رقم الترخيص مستخدم من قبل.',

    'license_file_path.required' => 'ملف الترخيص مطلوب.',
    'license_file_path.file' => 'ملف الترخيص يجب أن يكون ملفًا صحيحًا.',

    'license_expiry_date.required' => 'تاريخ انتهاء الترخيص مطلوب.',
    'license_expiry_date.date' => 'تاريخ انتهاء الترخيص يجب أن يكون تاريخًا صحيحًا.',

    'phone_number_pharmacy.required' => 'رقم هاتف الصيدلية مطلوب.',
    'phone_number_pharmacy.string' => 'رقم الهاتف يجب أن يكون نصًا.',
    'phone_number_pharmacy.max' => 'رقم الهاتف لا يجب أن يتجاوز 20 رقمًا.',
    'phone_number_pharmacy.unique' => 'رقم الهاتف مستخدم من قبل.',

    'email_pharmacy.required' => 'البريد الإلكتروني للصيدلية مطلوب.',
    'email_pharmacy.email' => 'صيغة البريد الإلكتروني للصيدلية غير صحيحة.',
    'email_pharmacy.unique' => 'صيغة البريد الإلكتروني مستخدم من قبل.',

    'status_exist.required' => 'حالة وجود الصيدلية مطلوبة.',
    'status_exist.in' => 'القيمة المدخلة لحالة الوجود غير صحيحة. يجب أن تكون "open" أو "closed".',


    'working_hours.required' => 'ساعات العمل مطلوبة.',
    'working_hours.string' => 'ساعات العمل يجب أن تكون نصًا.',



    'TOKEN_VALID' => 'الرمز صالح ' ,
//    'NO_DATA' => ' لا يوجد بيانات ' ,
//    'name' => [
//        'required' => 'حقل اسم مطلوب.',
//        'string' => 'حقل الاسم يجب أن يكون نصًا.',
//        'max' => 'لا يمكن أن يتجاوز  عدد المستخدين  4 .',
//
//    ],
//    'members' => [
//        'required' => 'حقل اسم مطلوب.',
//        'string' => 'يجب أن يكون رقم الهاتف نصًا.',
//        'max' => 'لا يمكن أن يتجاوزعدد المستخدمين    4  .',
//        'min' => 'لا يمكن أن يتجاوز عدد المستخدمي    2  .',
//
//    ],
//         'exists' => 'المسخدمين التي تم ارفاقهم غير موجودين ',
//
//    'name_game' => [
//        'required' => 'حقل اسم اللعبة مطلوب.',
//        'max' => 'يجب ان يكون حجم الاسم اقل من 255 حرف '
//     ],
//    'challenge_id' => [
//        'required' => 'رقم التحدي مطلوب.',
//        'integer' => 'رقم التحدي يجب أن يكون عدد صحيح.',
//        'exists' => 'رقم التحدي المحدد غير صالح.',
//    ],

    'first_competitor_id' => [
        'required' => 'رقم المتسابق الأول مطلوب.',
        'integer' => 'رقم المتسابق الأول يجب أن يكون عدد صحيح.',
        'exists' => 'رقم المتسابق الأول المحدد غير صالح.',
    ],

    'second_competitor_id' => [
        'required' => 'رقم المتسابق الثاني مطلوب.',
        'integer' => 'رقم المتسابق الثاني يجب أن يكون عدد صحيح.',
        'exists' => 'رقم المتسابق الثاني المحدد غير صالح.',
    ],
    'type_game' => [
        'required' =>'يجب إدخال حقل نوع اللعبة.' ,
        'in' => 'يجب تحديد طبيعة التحدي، سواء كان  فرديًا ادخل (I) أو فريقًا  ادخل (T).',
    ],
    'winner_id' => [
        'required' => 'رقم الفائز مطلوب.',
        'integer' => 'رقم الفائز يجب أن يكون عدد صحيح.',
        'exists' => 'رقم الفائز المحدد غير صالح.',
    ],

    'score_FC' => [
        'required' => 'النتيجة للمتسابق الاول مطلوبة.',
        'integer' => 'النتيجة للمتسابق  الاول يجب أن تكون عدد صحيح.',
        'max' => 'النتيجة للمتسابق الاول  يجب ألا تتجاوز :max.',
    ],

    'score_SC' => [
        'required' => 'النتيجة للمتسابق الثاني  مطلوبة.',
        'integer' => 'النتيجة للمتسابق الثاني  يجب أن تكون عدد صحيح.',
        'max' => 'النتيجة للمتسابق الثاني  يجب ألا تتجاوز :max.',
    ],
    'categories_id' => [
        'required' => 'حقل نوع اللعبة مطلوب ' ,
        'integer' => 'يجب ان يكون نوع اللعبة المرجع رقم' ,
        'not_in' =>  'نوع اللعبة المرفق غير صحيح ' ,
        'array' => 'يجب ان يكون نوع اللعبة المرجع قائمة' ,
        'min' => 'يجب اختيار على اقل 8 فئات ' ,
        'exists' =>  'إحدى الفئات المحددة غير موجودة' ,
    ],
    'answer_text_ar.required' => 'حقل نص الاجابة مطلوب' ,
    'blocked_Admin' => 'تم حظر حسابك من قبل المشرف',
    'categories_id.*.exists' => 'إحدى الفئات المحددة غير موجودة' ,
    'categories_id.*.required' => 'كل معرف في القائمة مطلوب',
    'categories_id.*.integer' => 'كل معرف يجب أن يكون رقمًا صحيحًا',

    'difficulty_level_update.required' =>  'يجب علي تحديد مستوى صعوبة السؤال' ,
    'difficulty_level.required' =>  'يجب علي تحديد مستوى صعوبة السؤال' ,


    'user1_id' => [
        'required' =>  'قيمة منشا اللعبة مطلوب ' ,
        'integer' =>   'مرجع حقل منشأ يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنشأ غير موجود '
    ],

    'team_member1_id' => [
        'required' =>  'قيمة فريق المنافس الاول مطلوب ' ,
        'integer' =>   'مرجع حقل الفريق المنافس الاول  يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس الاول   غير موجود '
    ],
    'team_member2_id' => [
        'required' =>  'قيمة فريق المنافس الثاني مطلوب ' ,
        'integer' =>   'مرجع حقل الفريق المنافس الثاني  يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس الثاني  غير موجود '
    ],

    'members' => [
        'exists' =>  'القيمة المرجعة من المستخدم غير موجود '
    ],
      'user2_id' => [
        'required' =>  'حقل المنافس مطلوب ' ,
        'integer' =>   'مرجع حقل منافس يجب ان يكون رقم ' ,
        'exists' =>  'القيمة المرجعة من حقل المنافس غير موجود '
         ],
    'competition_over_competitor_notification_title' => 'المسابقة على وشك الانتهاء !' ,
    'competition_over_competitor_notification_body' => 'صديقك انتهى من اللعبة بقية القليل من وقت ' ,
    'invitation_accept_competitor_notification_title'=> 'التحدي قد بدا!' ,
    'invitation_accept_competitor_notification_body' => 'وافق على انضمام  لتحدي هيا بنا !' ,
    'invitation_notification_title' => 'منافسة جديدة !' ,
    'invitation_notification_body' => 'احمد قام بدعوتك لمنافسة في تطبيق جاوبنا هي بنا ! ' ,
    'accept_friend_request_notification_title' => 'تم قبول طلب الصداقة!' ,
    'accept_friend_request_notification_body' => ' قبل طلب الصداقة الخاص بك. قل مرحبًا وابدأ لعبة معًا!' ,
    'friend_request_notification_title' => 'طلب الصداقة' ,
    'friend_request_notification_body' => 'أرسل لك طلب صداقة ' ,
    'sender_id.required' => 'حقل الاسم مطلوب.',
    'sender_id.exists' => ' رقم معرف غير موجود',
    'receiver_id.required' => 'حقل الاسم مطلوب.',
    'receiver_id.exists' => ' رقم معرف غير موجود',
    'id.exists' => 'الفئة المحددة ليست فئة أساسية صالحة.',
    'id.required' => 'حقل المعرف  مطلوب.',
    'id.integer' => 'يجب ان يكون المعرف رقما ',
    'ERROR_OCCURRED' => 'حدث خطأ ' ,
    'id_not_found' => 'حدث خطأ:عنصر  غير موجود  ' ,
    'friend_request_exists' =>'لقد قمت بارسال طلب الصداقة مسبقا!' ,
    'invalid_credentials' => 'كلمة المرور او الايميل غير صالحين ' ,
    'title.required' => 'حقل عنوان مطلوب.',
    'title.string' => 'يجب أن يكون الاسم نصًا.',
    'title.max' => 'لا يمكن أن يتجاوز طول الاسم 255 حرفًا.',

    'description.required' => 'حقل تفاصيل مطلوب.',
    'description.string' => 'يجب أن يكون تفاصيل نصًا.',

    'full_name.required' => 'حقل الاسم الكامل مطلوب.',
    'full_name.string' => 'يجب أن يكون الاسم الكامل نصًا.',
    'full_name.max' => 'لا يمكن أن يتجاوز طول الاسم الكامل 255 حرفًا.',

    'email.required' => 'حقل البريد الإلكتروني مطلوب.',
    'email.string' => 'يجب أن يكون البريد الإلكتروني نصًا.',
    'email.email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    'email.max' => 'لا يمكن أن يتجاوز طول البريد الإلكتروني 255 حرفًا.',
    'email.unique' => 'البريد الإلكتروني مستخدم بالفعل.',

    'phone.required' => 'حقل رقم الهاتف مطلوب.',
    'phone.string' => 'يجب أن يكون رقم الهاتف نصًا.',
    'phone.unique' => 'رقم الهاتف مستخدم بالفعل.',
    'phone.prefix' => 'يجب أن يحتوي رقم الجوال على مقدمة الدولة :prefix ويتكون من 9 إلى 14 رقماً.',
    'password' => [
        'required' => 'حقل كلمة المرور مطلوب.',
        'string' => 'يجب أن تكون كلمة المرور عبارة عن سلسلة.',
        'min' => 'يجب أن تكون كلمة المرور على الأقل :min حرفًا.',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        'letters' => 'يجب أن تحتوي كلمة المرور على حرف واحد على الأقل.',
        'mixed_case' => 'يجب أن تحتوي كلمة المرور على أحرف كبيرة وصغيرة.',
        'numbers' => 'يجب أن تحتوي كلمة المرور على رقم واحد على الأقل.',
        'symbols' => 'يجب أن تحتوي كلمة المرور على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت كلمة المرور المقدمة في خرق للبيانات. يرجى اختيار كلمة مرور مختلفة.',
    ],
    'email' => [
        'required' => 'البريد الإلكتروني مطلوب.',
        'email' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    ],
    'country' => [
        'required' => 'الدولة مطلوب',
    ] ,
    'phone' => [
        'required' => 'رقم الهاتف مطلوب.',
        'mobile_number' => 'رقم الهاتف يحتاج إلى بادئة'
    ],
    'verification_method' => [
        'required' => 'طريقة التحقق مطلوبة.',
        'in' => 'يجب أن تكون طريقة التحقق إما عبر البريد الإلكتروني أو الهاتف.',
    ],
    'name_ar' => [
        'required' => 'اسم اللعبة باللغة العربية مطلوب.',
        'string' => 'اسم اللعبة باللغة العربية يجب أن يكون نصاً.',
        'unique' => 'اسم اللعبة باللغة العربية موجود بالفعل.',
        'max' => 'اسم اللعبة باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],

    'name_en' => [
        'required' => 'اسم اللعبة باللغة العربية مطلوب.',
        'string' => 'اسم اللعبة باللغة العربية يجب أن يكون نصاً.',
        'unique' => 'اسم اللعبة باللغة العربية موجود بالفعل.',
        'max' => 'اسم اللعبة باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],




    'description_ar' => [
        'required' => 'الوصف باللغة العربية مطلوب.',
        'string' => 'الوصف باللغة العربية يجب أن يكون نصاً.',
        'max' => 'الوصف باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],
    'description_en' => [
        'required' => 'الوصف باللغة العربية مطلوب.',
        'string' => 'الوصف باللغة العربية يجب أن يكون نصاً.',
        'max' => 'الوصف باللغة العربية يجب ألا يتجاوز 255 حرفاً.',
    ],



    'rating' => [
        'required' => 'التقييم مطلوب.',
        'numeric' => 'التقييم يجب أن يكون رقماً.',
        'min' => 'التقييم يجب أن يكون أكبر من أو يساوي 0.',
        'max' => 'التقييم يجب أن يكون أقل من أو يساوي 5.',
    ],



    'parent_id' => [
        'integer' => 'المعرف الأب يجب أن يكون رقماً صحيحاً.',
        'min' => 'المعرف الأب يجب أن يكون أكبر من أو يساوي 0.',
        'exists' => 'المعرف الأب غير موجود.',
    ],

    'famous_gaming' => [
        'boolean' => 'الخاصية يجب أن تكون قيمة منطقية (صحيح/خطأ).',
    ],
    'question_ar_text' => [
        'required' => 'نص السؤال باللغة العربية مطلوب.',
        'string' => 'يجب أن يكون نص السؤال باللغة العربية نصًا.',
        'unique' => 'يجب أن يكون نص السؤال باللغة العربية فريدًا.',
        'max' => 'يجب ألا يتجاوز نص السؤال باللغة العربية 255 حرفًا.',
    ],
    'question_en_text' => [
        'required' => 'نص السؤال باللغة الإنجليزية مطلوب.',
        'string' => 'يجب أن يكون نص السؤال باللغة الإنجليزية نصًا.',
        'unique' => 'يجب أن يكون نص السؤال باللغة الإنجليزية فريدًا.',
        'max' => 'يجب ألا يتجاوز نص السؤال باللغة الإنجليزية 255 حرفًا.',
    ],



];
